ХМНПФ_Общее/DataProcessors/уп_НачислениеПенсийОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_НачислениеПенсийОПС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХМ_ТолькоНовые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХМ_НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХМ_КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>уп_ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачислятьЗаПрошлыеПериоды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Переключатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПенсионныйДоговор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаФормированияДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пожизненная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Срочная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаДоговоров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОчередностьВыплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоПачкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоВПачке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтборПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтборПенсионныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтборГруппаДоговоров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтборОчередностьВыплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИспользоватьОтборОчередностьВыплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НовыеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уп_НачислениеПенсийОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ХМНПФ_Общее/DataProcessors/уп_НачислениеПенсийОПС/Forms/уф_Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// ХМНПФ 17.01.2020 ШадринАВ // Новая ХМ_УстановитьДействияФормы() // №2628
	ХМ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка);
	
	ПараметрыЭлемента = Новый Структура;
	ПараметрыЭлемента.Вставить("ТипЭлемента", "ГруппаФормы");
	ПараметрыЭлемента.Вставить("Родитель", Элементы.Группа3);
	ХМ_Группа = ХМ_РаботаСФормами.НовоеПолеФормы(ЭтаФорма.Элементы, "ХМ_Группа", НСтр("ru = 'Группа'"), ПараметрыЭлемента);
	ХМ_Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;	
	
	ПараметрыЭлемента = Новый Структура;
	ПараметрыЭлемента.Вставить("Вид", ВидПоляФормы.ПолеФлажка);
	ПараметрыЭлемента.Вставить("ТипЭлемента", "ПолеФормы");
	ПараметрыЭлемента.Вставить("Родитель", ХМ_Группа);
	ПараметрыЭлемента.Вставить("ПутьКДанным", "Объект.ХМ_ТолькоНовые");
	ХМ_ТолькоНовые = ХМ_РаботаСФормами.НовоеПолеФормы(ЭтаФорма.Элементы, "ХМ_ТолькоНовые", НСтр("ru = 'Только новые'"), ПараметрыЭлемента);
	ХМ_ТолькоНовые.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ХМ_ТолькоНовые.УстановитьДействие("ПриИзменении", "ХМ_ТолькоНовыеПриИзменении");

	
	ПараметрыЭлемента = Новый Структура;
	ПараметрыЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	ПараметрыЭлемента.Вставить("ТипЭлемента", "ПолеФормы");
	ПараметрыЭлемента.Вставить("Родитель", ХМ_Группа);
	ПараметрыЭлемента.Вставить("ПутьКДанным", "Объект.ХМ_НачалоПериода");
	ХМ_НачалоПериода = ХМ_РаботаСФормами.НовоеПолеФормы(ЭтаФорма.Элементы, "ХМ_НачалоПериода", НСтр("ru = 'от'"), ПараметрыЭлемента);
	
	ПараметрыЭлемента = Новый Структура;
	ПараметрыЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	ПараметрыЭлемента.Вставить("ТипЭлемента", "ПолеФормы");
	ПараметрыЭлемента.Вставить("Родитель", ХМ_Группа);
	ПараметрыЭлемента.Вставить("ПутьКДанным", "Объект.ХМ_КонецПериода");
	ХМ_КонецПериода = ХМ_РаботаСФормами.НовоеПолеФормы(ЭтаФорма.Элементы, "ХМ_КонецПериода", НСтр("ru = 'до'"), ПараметрыЭлемента);
	
	Элементы.НовыеНачисления.УстановитьДействие("ПриАктивизацииСтроки", "ХМ_НовыеНачисленияПриАктивизацииСтроки");

КонецПроцедуры

&НаКлиенте
Процедура ХМ_ТолькоНовыеПриИзменении(Элемент)

    Объект.НачислятьЗаПрошлыеПериоды = Не Объект.ХМ_ТолькоНовые;
	Элементы.НачислятьЗаПрошлыеПериоды.ТолькоПросмотр = Объект.ХМ_ТолькоНовые;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("СформироватьНаСервере")
Процедура ХМСформироватьНаСервере()

	СтруктураОбр = Новый Структура;

	Для Каждого Реквизит Из Обработки.уп_НачислениеПенсийОПС.Создать().Метаданные().Реквизиты Цикл

		СтруктураОбр.Вставить(Реквизит.Имя, Объект[Реквизит.Имя]);

	КонецЦикла;

	СтруктураОбр.Вставить("НовыеНачисления", Объект.НовыеНачисления.Выгрузить());

	АдресОбъекта = ПоместитьВоВременноеХранилище(СтруктураОбр, ЭтаФорма.УникальныйИдентификатор);

	Парам = Новый Массив;
	Парам.Добавить(СтруктураОбр);
	Парам.Добавить(АдресОбъекта);
#Удаление 
	ФоновоеЗадание = ФоновыеЗадания.Выполнить("уп_ОПС.СформироватьТЗДокумента", Парам);
#КонецУдаления
#Вставка 
	// +ХМНПФ 17.01.2020 ШадринАВ // СформироватьНаСервере() // ОПС_Начисления_прош_пер
	Парам.Добавить(хм_РегистрацияСобытийПривелигирован.ПолучитьЗначениеИмяПККлиента());
	ФоновоеЗадание = ФоновыеЗадания.Выполнить("уп_ОПС.ХМ_СформироватьТЗДокумента", Парам);
	// -ХМНПФ 17.01.2020 ШадринАВ // СформироватьНаСервере() // ОПС_Начисления_прош_пер
#КонецВставки
	Идентификатор = ФоновоеЗадание.УникальныйИдентификатор;

КонецПроцедуры

// ХМНПФ 17.01.2020 ШадринАВ // Новая ХМ_ПриСозданииНаСервере() // №2628
&НаСервере
Процедура ХМ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ХМ_РаботаСФормами.Обработкауп_НачислениеПенсийОПСуф_ФормаПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	Объект.Переключатель1 = 1;
	Объект.НачислятьЗаПрошлыеПериоды = Истина;
	Объект.ХМ_КоличествоПрошлыхПериодов = 3;
	Элементы.НовыеНачисления.Подвал = Истина;
КонецПроцедуры // ХМ_ПриСозданииНаСервере()

// ХМНПФ 13.05.2020 ШадринАВ // Новая ХМ_НовыеНачисленияПриАктивизацииСтроки() // №2628
&НаКлиенте
Процедура ХМ_НовыеНачисленияПриАктивизацииСтроки(Элемент)
	НомерСтроки = 0;
	Сумма = 0;
	ХМ_НовыеНачисленияПриАктивизацииСтрокиНаСервере(НомерСтроки, Сумма);
	Элементы.НовыеНачисления.ПодчиненныеЭлементы.НовыеНачисленияДокументСуммаДокумента.ТекстПодвала = Сумма;
	Элементы.НовыеНачисления.ПодчиненныеЭлементы.НовыеНачисленияНомерСтроки.ТекстПодвала = НомерСтроки;
КонецПроцедуры

// ХМНПФ 13.05.2020 ШадринАВ // Новая ХМ_НовыеНачисленияПриАктивизацииСтрокиНаСервере() // №2628
&НаСервере
Процедура ХМ_НовыеНачисленияПриАктивизацииСтрокиНаСервере(НомерСтроки, Сумма)
	Для каждого ДанныеСтроки Из Объект.НовыеНачисления Цикл
		Сумма = Сумма + ДанныеСтроки.Документ.СуммаДокумента;	
		НомерСтроки = НомерСтроки + ДанныеСтроки.Документ.ДоговорыОПС.Количество();	
	КонецЦикла;
КонецПроцедуры

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 21.10.2015 ШадринАВ // новое поле КоличествоПрошлыхПериодов // ОПС_Начисления_прош_пер
	// ХМНПФ 17.01.2020 ШадринАВ // Модуль // №2628
	// ХМНПФ 17.01.2020 ШадринАВ // Новая ХМ_УстановитьДействияФормы() // №2628
	// ХМНПФ 17.01.2020 ШадринАВ // Новая ХМ_ПриСозданииНаСервере() // №2628
	// ХМНПФ 17.01.2020 ШадринАВ // СформироватьНаСервере() // ОПС_Начисления_прош_пер
	// ХМНПФ 13.05.2020 ШадринАВ // Новая ХМ_НовыеНачисленияПриАктивизацииСтроки() // №2628
	// ХМНПФ 13.05.2020 ШадринАВ // Новая ХМ_НовыеНачисленияПриАктивизацииСтрокиНаСервере() // №2628
КонецПроцедуры
